zephyrproject-rtos/zephyr/soc/nxp/lpc/lpc55xxx/lpc55sxx_clocks.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define NXP_CLK_TYPE_SHIFT  16
#define NXP_CLK_TYPE_NO_CLOCK (0 << NXP_CLK_TYPE_SHIFT)

/* NO_CLOCK clocks */
#define NXP_CLOCK_NO_CLOCK (NXP_CLK_TYPE_NO_CLOCK | 0)

#define NXP_CLK_TYPE_CLOCK_SOURCE (1 << NXP_CLK_TYPE_SHIFT)

/* CLOCK_SOURCE clocks */
#define NXP_CLOCK_FRO_12M (NXP_CLK_TYPE_CLOCK_SOURCE | 0)
#define NXP_CLOCK_XTAL32M (NXP_CLK_TYPE_CLOCK_SOURCE | 1)
#define NXP_CLOCK_FRO_1M (NXP_CLK_TYPE_CLOCK_SOURCE | 2)
#define NXP_CLOCK_FRO_HF (NXP_CLK_TYPE_CLOCK_SOURCE | 3)
#define NXP_CLOCK_FRO_32K (NXP_CLK_TYPE_CLOCK_SOURCE | 4)
#define NXP_CLOCK_XTAL32K (NXP_CLK_TYPE_CLOCK_SOURCE | 5)
#define NXP_CLOCK_MCLK_IN (NXP_CLK_TYPE_CLOCK_SOURCE | 6)
#define NXP_CLOCK_PLU_CLKIN (NXP_CLK_TYPE_CLOCK_SOURCE | 7)

#define NXP_CLK_TYPE_CLOCK_ENABLE (2 << NXP_CLK_TYPE_SHIFT)

/* CLOCK_ENABLE clocks */
#define NXP_CLOCK_PLUGLITCH12MHZCLK (NXP_CLK_TYPE_CLOCK_ENABLE | 0)
#define NXP_CLOCK_CLK_IN_EN (NXP_CLK_TYPE_CLOCK_ENABLE | 1)
#define NXP_CLOCK_CLK_USB_EN (NXP_CLK_TYPE_CLOCK_ENABLE | 2)
#define NXP_CLOCK_UTICKCLK (NXP_CLK_TYPE_CLOCK_ENABLE | 3)
#define NXP_CLOCK_PLUGLITCH1MHZCLK (NXP_CLK_TYPE_CLOCK_ENABLE | 4)
#define NXP_CLOCK_OSTIMER32KHZCLK (NXP_CLK_TYPE_CLOCK_ENABLE | 5)
#define NXP_CLOCK_RTC_1HZ_CLK (NXP_CLK_TYPE_CLOCK_ENABLE | 6)
#define NXP_CLOCK_RTC_1KHZ_CLK (NXP_CLK_TYPE_CLOCK_ENABLE | 7)

#define NXP_CLK_TYPE_TOP_CLOCK_OUTPUT (3 << NXP_CLK_TYPE_SHIFT)

/* TOP_CLOCK_OUTPUT clocks */
#define NXP_CLOCK_PLU_GLITCH_12MHZ_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 0)
#define NXP_CLOCK_USB1_PHY_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 1)
#define NXP_CLOCK_WDT_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 2)
#define NXP_CLOCK_UTICK_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 3)
#define NXP_CLOCK_PLU_GLITCH_1MHZ_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 4)
#define NXP_CLOCK_PLUCLKIN_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 5)
#define NXP_CLOCK_OSTIMER32KHZ_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 6)
#define NXP_CLOCK_OSC32KHZ_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 7)
#define NXP_CLOCK_RTC1HZ_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 8)
#define NXP_CLOCK_RTC1KHZ_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 9)
#define NXP_CLOCK_SYSTEM_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 10)
#define NXP_CLOCK_TRACE_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 11)
#define NXP_CLOCK_SYSTICK0_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 12)
#define NXP_CLOCK_SYSTICK1_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 13)
#define NXP_CLOCK_ASYNCADC_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 14)
#define NXP_CLOCK_USB0_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 15)
#define NXP_CLOCK_MCLK_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 16)
#define NXP_CLOCK_SCT_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 17)
#define NXP_CLOCK_CLKOUT_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 18)
#define NXP_CLOCK_SDIO_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 19)
#define NXP_CLOCK_CTIMER0_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 20)
#define NXP_CLOCK_CTIMER1_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 21)
#define NXP_CLOCK_CTIMER2_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 22)
#define NXP_CLOCK_CTIMER3_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 23)
#define NXP_CLOCK_CTIMER4_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 24)
#define NXP_CLOCK_FXCOM0_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 25)
#define NXP_CLOCK_FXCOM1_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 26)
#define NXP_CLOCK_FXCOM2_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 27)
#define NXP_CLOCK_FXCOM3_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 28)
#define NXP_CLOCK_FXCOM4_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 29)
#define NXP_CLOCK_FXCOM5_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 30)
#define NXP_CLOCK_FXCOM6_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 31)
#define NXP_CLOCK_FXCOM7_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 32)
#define NXP_CLOCK_HSLSPI_CLOCK (NXP_CLK_TYPE_TOP_CLOCK_OUTPUT | 33)

#define NXP_CLK_TYPE_PRESCALER (4 << NXP_CLK_TYPE_SHIFT)

/* PRESCALER clocks */
#define NXP_CLOCK_WDTCLKDIV (NXP_CLK_TYPE_PRESCALER | 0)
#define NXP_CLOCK_FROHFDIV (NXP_CLK_TYPE_PRESCALER | 1)
#define NXP_CLOCK_RTCCLK1HZDIV (NXP_CLK_TYPE_PRESCALER | 2)
#define NXP_CLOCK_RTCCLK1KHZDIV (NXP_CLK_TYPE_PRESCALER | 3)
#define NXP_CLOCK_PLL0_PDEC (NXP_CLK_TYPE_PRESCALER | 4)
#define NXP_CLOCK_PLL0DIV (NXP_CLK_TYPE_PRESCALER | 5)
#define NXP_CLOCK_PLL1_PDEC (NXP_CLK_TYPE_PRESCALER | 6)
#define NXP_CLOCK_TRACECLKDIV (NXP_CLK_TYPE_PRESCALER | 7)
#define NXP_CLOCK_SYSTICKCLKDIV0 (NXP_CLK_TYPE_PRESCALER | 8)
#define NXP_CLOCK_SYSTICKCLKDIV1 (NXP_CLK_TYPE_PRESCALER | 9)
#define NXP_CLOCK_AHBCLKDIV (NXP_CLK_TYPE_PRESCALER | 10)
#define NXP_CLOCK_ADCCLKDIV (NXP_CLK_TYPE_PRESCALER | 11)
#define NXP_CLOCK_USB0CLKDIV (NXP_CLK_TYPE_PRESCALER | 12)
#define NXP_CLOCK_MCLKDIV (NXP_CLK_TYPE_PRESCALER | 13)
#define NXP_CLOCK_SCTCLKDIV (NXP_CLK_TYPE_PRESCALER | 14)
#define NXP_CLOCK_CLKOUTDIV (NXP_CLK_TYPE_PRESCALER | 15)
#define NXP_CLOCK_SDIOCLKDIV (NXP_CLK_TYPE_PRESCALER | 16)
#define NXP_CLOCK_FRGCTRL0_MUL (NXP_CLK_TYPE_PRESCALER | 17)
#define NXP_CLOCK_FRGCTRL0_DIV (NXP_CLK_TYPE_PRESCALER | 18)
#define NXP_CLOCK_FRGCTRL1_MUL (NXP_CLK_TYPE_PRESCALER | 19)
#define NXP_CLOCK_FRGCTRL1_DIV (NXP_CLK_TYPE_PRESCALER | 20)
#define NXP_CLOCK_FRGCTRL2_MUL (NXP_CLK_TYPE_PRESCALER | 21)
#define NXP_CLOCK_FRGCTRL2_DIV (NXP_CLK_TYPE_PRESCALER | 22)
#define NXP_CLOCK_FRGCTRL3_MUL (NXP_CLK_TYPE_PRESCALER | 23)
#define NXP_CLOCK_FRGCTRL3_DIV (NXP_CLK_TYPE_PRESCALER | 24)
#define NXP_CLOCK_FRGCTRL4_MUL (NXP_CLK_TYPE_PRESCALER | 25)
#define NXP_CLOCK_FRGCTRL4_DIV (NXP_CLK_TYPE_PRESCALER | 26)
#define NXP_CLOCK_FRGCTRL5_MUL (NXP_CLK_TYPE_PRESCALER | 27)
#define NXP_CLOCK_FRGCTRL5_DIV (NXP_CLK_TYPE_PRESCALER | 28)
#define NXP_CLOCK_FRGCTRL6_MUL (NXP_CLK_TYPE_PRESCALER | 29)
#define NXP_CLOCK_FRGCTRL6_DIV (NXP_CLK_TYPE_PRESCALER | 30)
#define NXP_CLOCK_FRGCTRL7_MUL (NXP_CLK_TYPE_PRESCALER | 31)
#define NXP_CLOCK_FRGCTRL7_DIV (NXP_CLK_TYPE_PRESCALER | 32)

#define NXP_CLK_TYPE_CLOCK_SELECT (5 << NXP_CLK_TYPE_SHIFT)

/* CLOCK_SELECT clocks */
#define NXP_CLOCK_MAINCLKSELA (NXP_CLK_TYPE_CLOCK_SELECT | 0)
#define NXP_CLOCK_RTCOSC32KSEL (NXP_CLK_TYPE_CLOCK_SELECT | 1)
#define NXP_CLOCK_PLL0CLKSEL (NXP_CLK_TYPE_CLOCK_SELECT | 2)
#define NXP_CLOCK_PLL0_DIRECTO (NXP_CLK_TYPE_CLOCK_SELECT | 3)
#define NXP_CLOCK_PLL0_BYPASS (NXP_CLK_TYPE_CLOCK_SELECT | 4)
#define NXP_CLOCK_PLL1CLKSEL (NXP_CLK_TYPE_CLOCK_SELECT | 5)
#define NXP_CLOCK_PLL1_DIRECTO (NXP_CLK_TYPE_CLOCK_SELECT | 6)
#define NXP_CLOCK_PLL1_BYPASS (NXP_CLK_TYPE_CLOCK_SELECT | 7)
#define NXP_CLOCK_MAINCLKSELB (NXP_CLK_TYPE_CLOCK_SELECT | 8)
#define NXP_CLOCK_TRACECLKSEL (NXP_CLK_TYPE_CLOCK_SELECT | 9)
#define NXP_CLOCK_SYSTICKCLKSEL0 (NXP_CLK_TYPE_CLOCK_SELECT | 10)
#define NXP_CLOCK_SYSTICKCLKSEL1 (NXP_CLK_TYPE_CLOCK_SELECT | 11)
#define NXP_CLOCK_ADCCLKSEL (NXP_CLK_TYPE_CLOCK_SELECT | 12)
#define NXP_CLOCK_USB0CLKSEL (NXP_CLK_TYPE_CLOCK_SELECT | 13)
#define NXP_CLOCK_MCLKCLKSEL (NXP_CLK_TYPE_CLOCK_SELECT | 14)
#define NXP_CLOCK_SCTCLKSEL (NXP_CLK_TYPE_CLOCK_SELECT | 15)
#define NXP_CLOCK_CLKOUTSEL (NXP_CLK_TYPE_CLOCK_SELECT | 16)
#define NXP_CLOCK_SDIOCLKSEL (NXP_CLK_TYPE_CLOCK_SELECT | 17)
#define NXP_CLOCK_CTIMERCLKSEL0 (NXP_CLK_TYPE_CLOCK_SELECT | 18)
#define NXP_CLOCK_CTIMERCLKSEL1 (NXP_CLK_TYPE_CLOCK_SELECT | 19)
#define NXP_CLOCK_CTIMERCLKSEL2 (NXP_CLK_TYPE_CLOCK_SELECT | 20)
#define NXP_CLOCK_CTIMERCLKSEL3 (NXP_CLK_TYPE_CLOCK_SELECT | 21)
#define NXP_CLOCK_CTIMERCLKSEL4 (NXP_CLK_TYPE_CLOCK_SELECT | 22)
#define NXP_CLOCK_FCCLKSEL0 (NXP_CLK_TYPE_CLOCK_SELECT | 23)
#define NXP_CLOCK_FCCLKSEL1 (NXP_CLK_TYPE_CLOCK_SELECT | 24)
#define NXP_CLOCK_FCCLKSEL2 (NXP_CLK_TYPE_CLOCK_SELECT | 25)
#define NXP_CLOCK_FCCLKSEL3 (NXP_CLK_TYPE_CLOCK_SELECT | 26)
#define NXP_CLOCK_FCCLKSEL4 (NXP_CLK_TYPE_CLOCK_SELECT | 27)
#define NXP_CLOCK_FCCLKSEL5 (NXP_CLK_TYPE_CLOCK_SELECT | 28)
#define NXP_CLOCK_FCCLKSEL6 (NXP_CLK_TYPE_CLOCK_SELECT | 29)
#define NXP_CLOCK_FCCLKSEL7 (NXP_CLK_TYPE_CLOCK_SELECT | 30)
#define NXP_CLOCK_HSLSPICLKSEL (NXP_CLK_TYPE_CLOCK_SELECT | 31)

#define NXP_CLK_TYPE_PLL (6 << NXP_CLK_TYPE_SHIFT)

/* PLL clocks */
#define NXP_CLOCK_PLL0 (NXP_CLK_TYPE_PLL | 0)
#define NXP_CLOCK_PLL1 (NXP_CLK_TYPE_PLL | 1)
